# ESMTP LIMITS extension, client MAILMAX
#
# Baseline: no MAILMAX advertised, can send 2 messages
# - limiting the RCPT to 1 is convenient to get the multiple messages
server PORT_D
220 Hi there
EHLO
250-yeah mate
250 LIMITS RCPTMAX=1
MAIL FROM
250 mail cmd 1 good
RCPT TO
250 rcpt cmd good
DATA
352 go ahead
.
250 message received
MAIL FROM
250 mail cmd 2 good
RCPT TO
250 rcpt cmd good
DATA
352 go ahead
.
250 message received
QUIT
220 bye
****
exim -odi a@test.ex b@test.ex
****
#
# limited to one MAIL per conn.  Client should immediate-retry a second one.
server PORT_D 2
220 Hi there
EHLO
250-yeah mate
250 LIMITS RCPTMAX=1 MAILMAX=1
MAIL FROM
250 mail cmd 1 good
RCPT TO
250 rcpt cmd good
DATA
352 go ahead
.
250 message received
QUIT
220 bye
*eof
220 Hi there
EHLO
250-yeah mate
250 LIMITS RCPTMAX=1 MAILMAX=1
MAIL FROM
250 mail cmd 2 good
RCPT TO
250 rcpt cmd good
DATA
352 go ahead
.
250 message received
QUIT
220 bye
****
exim -odi a@test.ex b@test.ex
****
