# message with no terminating LF
need_ipv4
#
server PORT_S
220 Server ready
EHLO
250 OK
MAIL FROM
250 OK
RCPT TO
250 OK
DATA
354 Send more
.
250 OK
QUIT
250 OK
****
exim -odi abc@x.y.z
:noeol:Test message
****
server PORT_S
220 Server ready
EHLO
250 OK
MAIL FROM
250 OK
RCPT TO
250 OK
DATA
354 Send more
.
250 OK
QUIT
250 OK
****
exim -odi abc@x.y.z
:noeol:Subject: Test message
****
