Connecting to ip4.ip4.ip4.ip4 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> HELO testclient
??? 250
<<< 250 myhost.test.ex Hello testclient [ip4.ip4.ip4.ip4]
>>> MAIL FROM:<a@example.com>
??? 250
<<< 250 OK
>>> RCPT TO:<fred@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 3
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: test
>>> From: z@example.com
>>> 
>>> body line
>>> .
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> QUIT
End of script
