Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo foobar
??? 250-
<<< 250-myhost.test.ex Hello foobar [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-PIPELINING
??? 250
<<< 250 HELP
>>> mail from:<test-local-scan@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> local-scan: reject rhubarb rhubarb
>>> .
??? 550
<<< 550 rhubarb rhubarb
>>> mail from:<test-local-scan@y>
??? 250
<<< 250 OK
>>> rcpt to:<x@y>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> local-scan: teergrube
>>> .
??? 550-
<<< 550-holding...
??? 550-
<<< 550-holding...
End of script
